# Вспомните какие модули вы уже проходили на курсе. 
# Создайте файл, в котором вы импортируете встроенные в модуль функции под псевдонимами. (3-7 строк импорта).

import math as m
import random as r
import datetime as dt

print(m.sqrt(16))
print(r.randint(1, 10))
print(dt.datetime.now())
